Repository: team-unstablers/NoctilucaServer
Catalog: NoctilucaClient/NoctilucaClient/resources/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

# session-settings.projection.codec.color_range.limited
source: 제한됨
en: Limited
ja: リミテッド
zh_hans: 有限 (Limited)

# session-settings.projection.codec.color_range.limited_desc_format
source: 제한된 색상 범위 %@를 사용합니다.
en: Use limited color range %@.
ja: 制限された色範囲 %@ を使用します。
zh_hans: 使用有限色彩范围 %@。

# session-settings.projection.codec.constantBitrate.description
source: 사용자가 지정한 비트레이트 값을 사용하도록 서버에게 요구합니다.
en: Requests the server to use a user-specified bitrate.
ja: ユーザーが指定したビットレート値を使用するようにサーバーに要求します。
zh_hans: 要求服务器使用用户指定的码率。

# session-settings.projection.codec.constantBitrateSlider.title
source: 비트레이트
en: Bitrate
ja: ビットレート
zh_hans: 码率

# session-settings.projection.codec.display_density
source: 디스플레이 밀도
en: Display Density
ja: ディスプレイ密度
zh_hans: 显示密度

# session-settings.projection.codec.display_density.auto_desc
source: 디스플레이 밀도를 자동으로 선택합니다.
en: Automatically select display density.
ja: ディスプレイ密度を自動的に選択します。
zh_hans: 自动选择显示密度。

# session-settings.projection.codec.display_density.best
source: 화질 우선
en: Quality First
ja: 画質優先
zh_hans: 画质优先

# session-settings.projection.codec.display_density.best_desc
source: HIDPI / Retina 디스플레이 밀도를 사용하려 노력합니다. 더 나은 화질을 제공하지만, 높은 대역폭과 컴퓨팅 자원을 사용합니다.
en: Attempt to use HIDPI / Retina display density. Provides better quality but uses high bandwidth and computing resources.
ja: HiDPI / Retinaディスプレイ密度を使用しようとします。 より良い画質を提供しますが、高い帯域幅とコンピューティングリソースを使用します。
zh_hans: 尝试使用 HIDPI / Retina 显示密度。 提供更好的画质，但会消耗更高的带宽和计算资源。

# session-settings.projection.codec.display_density.default_desc
source: 디스플레이 밀도를 설정합니다.
en: Set display density.
ja: ディスプレイ密度を設定します。
zh_hans: 设置显示密度。

# session-settings.projection.codec.display_density.performance
source: 성능 우선
en: Performance First
ja: パフォーマンス優先
zh_hans: 性能优先

# session-settings.projection.codec.display_density.performance_desc
source: 성능을 우선시하여 디스플레이 밀도를 설정합니다. 대부분의 경우 1x 밀도로 설정됩니다.
en: Prioritize performance when setting display density. In most cases, it is set to 1x density.
ja: パフォーマンスを優先してディスプレイ密度を設定します。 ほとんどの場合、1x密度に設定されます。
zh_hans: 优先考虑性能来设置显示密度。 大多数情况下会设置为 1x 密度。

# session-settings.projection.codec.dynamic_range
source: 다이나믹 레인지
en: Dynamic Range
ja: ダイナミックレンジ
zh_hans: 动态范围

# session-settings.projection.codec.dynamic_range.default_desc
source: 다이나믹 레인지를 설정합니다.
en: Set dynamic range.
ja: ダイナミックレンジを設定します。
zh_hans: 设置动态范围。

# session-settings.projection.codec.dynamic_range.hdr_desc
source: 사용 가능한 경우 HDR 다이나믹 레인지를 사용합니다.
en: Use HDR dynamic range if available.
ja: 使用可能な場合、HDRダイナミックレンジを使用します。
zh_hans: 尽可能使用 HDR 动态范围。

# session-settings.projection.codec.dynamic_range.sdr_desc
source: 표준 다이나믹 레인지를 사용합니다.
en: Use Standard Dynamic Range.
ja: 標準ダイナミックレンジを使用します。
zh_hans: 使用标准动态范围。

# session-settings.projection.codec.frame_rate
source: 프레임 속도
en: Frame Rate
ja: フレームレート
zh_hans: 帧率

# session-settings.projection.codec.frame_rate.auto_desc
source: 최대 프레임 속도의 결정을 서버에게 맡깁니다.
en: Leave the determination of the maximum frame rate to the server.
ja: クライアントのネゴシエーション内容に基づいてフレームレートを決定します。
zh_hans: 将最大帧率的决定权交给服务器。

# session-settings.projection.codec.frame_rate.set_desc_format
source: 프레임 속도를 최대 %d FPS로 제한합니다.
en: Set max frame rate to %d FPS.
ja: フレームレートを最大 %d FPSに設定します。
zh_hans: 将帧率限制为最大 %d FPS。

# session-settings.projection.codec.hw_accel
source: 하드웨어 가속
en: Hardware Acceleration
ja: ハードウェアアクセラレーション
zh_hans: 硬件加速

# session-settings.projection.codec.hw_accel.auto_desc
source: 서버가 환경에 맞춰 하드웨어 가속 사용 여부를 자동으로 결정합니다.
en: The server automatically decides whether to use hardware acceleration based on the environment.
ja: サーバーが環境に合わせてハードウェアアクセラレーション使用可否を自動的に決定します。
zh_hans: 服务器根据环境自动决定是否使用硬件加速。

# session-settings.projection.codec.hw_accel.default_desc
source: 서버 인코딩의 하드웨어 가속 요청 정책을 설정합니다.
en: Set policy for requesting hardware acceleration for server encoding.
ja: サーバーエンコードのハードウェアアクセラレーション要求ポリシーを設定します。
zh_hans: 设置服务器编码的硬件加速请求策略。

# session-settings.projection.codec.hw_accel.disabled
source: 사용 안 함
en: Disabled
ja: 使用しない
zh_hans: 不使用

# session-settings.projection.codec.hw_accel.disabled_desc
source: 서버에게 하드웨어 가속 사용을 요청합니다. 참고: 옵션 이름은 legacy 호환성 때문에 false로 표시됩니다.
en: Request hardware acceleration from the server. Note: Option name appears as false due to legacy compatibility.
ja: サーバーにハードウェアアクセラレーションの使用を要求します。 参考: オプション名はレガシー互換性のためfalseと表示されます。
zh_hans: 请求服务器使用硬件加速。 注意：由于遗留兼容性原因，选项名称显示为 false。

# session-settings.projection.codec.lossless.description
source: 무손실 압축을 사용하도록 요구합니다. 상당한 네트워크 대역폭을 사용하기 때문에 빠른 속도의 인터넷 연결을 필요로 합니다.
en: Requests the server to use lossless compression. Requires a high-speed internet connection as it consumes significant network bandwidth.
ja: ロスレス圧縮を使用するように要求します。 かなりのネットワーク帯域幅を使用するため、高速なインターネット接続が必要です。
zh_hans: 要求使用无损压缩。 因为会消耗大量网络带宽，所以需要高速的互联网连接。

# session-settings.projection.codec.lossless.mode.balanced
source: 자동
en: Balanced
ja: 自動
zh_hans: 自动

# session-settings.projection.codec.lossless.mode.balanced_desc
source: 성능과 압축률 간의 균형을 맞춥니다.
en: Balances performance and compression ratio.
ja: パフォーマンスと圧縮率のバランスを取ります。
zh_hans: 在性能和压缩率之间取得平衡。

# session-settings.projection.codec.lossless.mode.compression
source: 압축률 우선
en: Prioritize Compression
ja: 圧縮率優先
zh_hans: 压缩率优先

# session-settings.projection.codec.lossless.mode.compression_desc
source: 압축률을 우선시 합니다. 딜레이가 늘어날 수 있습니다.
en: Prioritizes compression ratio. This may increase latency.
ja: 圧縮率を優先します。遅延が増加する可能性があります。
zh_hans: 优先考虑压缩率。可能会增加延迟。

# session-settings.projection.codec.lossless.mode.default_desc
source: 무손실 압축 모드를 선택합니다.
en: Select a lossless compression mode.
ja: ロスレス圧縮モードを選択します。
zh_hans: 选择无损压缩模式。

# session-settings.projection.codec.lossless.mode.speed
source: 압축 속도 우선
en: Prioritize Speed
ja: 圧縮速度優先
zh_hans: 压缩速度优先

# session-settings.projection.codec.lossless.mode.speed_desc
source: 압축 속도를 우선시 합니다. 대역폭 사용량이 늘어날 수 있습니다.
en: Prioritizes compression speed. This may increase bandwidth usage.
ja: 圧縮速度を優先します。帯域幅の使用量が増加する可能性があります。
zh_hans: 优先考虑压缩速度。可能会增加带宽使用量。

# session-settings.projection.codec.lossless.mode.title
source: 무손실 압축 모드
en: Lossless Compression Mode
ja: ロスレス圧縮モード
zh_hans: 无损压缩模式

# session-settings.projection.codec.max_resolution
source: 최대 해상도
en: Max Resolution
ja: 最大解像度
zh_hans: 最大分辨率

# session-settings.projection.codec.max_resolution.auto_desc
source: 최대 해상도의 결정을 서버에게 맡깁니다.
en: Leave the determination of the maximum resolution to the server.
ja: クライアントのネゴシエーション内容に基づいて最大解像度を決定します。
zh_hans: 根据客户端的协商内容决定最大分辨率。

# session-settings.projection.codec.max_resolution.set_desc_format
source: 최대 해상도를 %@으로 제한합니다.
en: Set max resolution to %@.
ja: 最大解像度を %@ に設定します。
zh_hans: 将最大分辨率设置为 %@。

# session-settings.projection.codec.profile
source: 코덱 프로파일
en: Codec Profile
ja: コーデックプロファイル
zh_hans: 编解码器 Profile

# session-settings.projection.codec.profile.auto_desc
source: 최적의 코덱 프로파일을 자동으로 선택합니다.
en: Automatically select optimal codec profile.
ja: 最適なコーデックプロファイルを自動的に選択します。
zh_hans: 自动选择最佳的编解码器 Profile。

# session-settings.projection.codec.profile.default_desc
source: 코덱 프로파일을 설정합니다.
en: Set codec profile.
ja: コーデックプロファイルを設定します。
zh_hans: 设置编解码器 Profile。

# session-settings.projection.codec.profile.h264_baseline
source: Baseline Profile (가장 높은 호환성, 압축률 낮음)
en: Baseline Profile (Highest compatibility, Low compression)
ja: Baselineプロファイル (最も高い互換性、圧縮率低い)
zh_hans: Baseline Profile (兼容性最高，压缩率低)

# session-settings.projection.codec.profile.h264_baseline_desc
source: 호환성이 높은 Baseline Profile을 사용합니다. 코덱의 고급 기능을 사용할 수 없기 때문에 압축률과 화질이 낮습니다.
en: Use highly compatible Baseline Profile. Compression and quality are lower because advanced codec features cannot be used.
ja: 互換性の高いBaselineプロファイルを使用します。 コーデックの高度な機能を使用できないため、圧縮率と画質は低くなります。
zh_hans: 使用兼容性较高的 Baseline Profile。 无法使用编解码器的高级功能，因此压缩率和画质较低。

# session-settings.projection.codec.profile.h264_high
source: High Profile (가장 낮은 호환성, 압축률 높음)
en: High Profile (Lowest compatibility, High compression)
ja: Highプロファイル (最も低い互換性、圧縮率高い)
zh_hans: High Profile (兼容性最低，压缩率高)

# session-settings.projection.codec.profile.h264_high_desc
source: High Profile을 사용합니다. 고급 기능을 사용하여 최고의 압축률과 화질을 제공합니다.
en: Use High Profile. Uses advanced features to provide the best compression and image quality.
ja: Highプロファイルを使用します。 高度な機能を使用して最高の圧縮率と画質を提供します。
zh_hans: 使用 High Profile。 利用高级功能提供最佳的压缩率和画质。

# session-settings.projection.codec.profile.h264_main_desc
source: Main Profile을 사용합니다. 대부분의 기기에서 적절한 호환성과 압축률을 제공합니다.
en: Use Main Profile. Provides adequate compatibility and compression for most devices.
ja: Mainプロファイルを使用します。 ほとんどのデバイスで適切な互換性と圧縮率を提供します。
zh_hans: 使用 Main Profile。 在大多数设备上提供适当的兼容性和压缩率。

# session-settings.projection.codec.profile.hevc_main_desc
source: Main Profile을 사용합니다. 대부분의 기기에서 적절한 호환성과 압축률을 제공합니다.
en: Use Main Profile. Provides adequate compatibility and compression for most devices.
ja: Mainプロファイルを使用します。 ほとんどのデバイスで適切な互換性と圧縮率を提供します。
zh_hans: 使用 Main Profile。 在大多数设备上提供适当的兼容性和压缩率。

# session-settings.projection.codec.profile.hevc_main10
source: Main10 Profile (10-bit 색상 지원)
en: Main10 Profile (10-bit color support)
ja: Main10プロファイル (10-bitカラー対応)
zh_hans: Main10 Profile (支持 10-bit 色彩)

# session-settings.projection.codec.profile.hevc_main10_desc
source: Main10 Profile을 사용합니다. 10-bit 색상 지원으로 더 풍부한 색상을 제공합니다.
en: Use Main10 Profile. Provides richer colors with 10-bit color support.
ja: Main10プロファイルを使用します。 10-bitカラー対応により、より豊かな色彩を提供します。
zh_hans: 使用 Main10 Profile。 支持 10-bit 色彩，提供更丰富的颜色。

# session-settings.projection.codec.quality.auto
source: 자동 조정 (권장)
en: Auto (Recommended)
ja: 自動調整 (推奨)
zh_hans: 自动调整 (推荐)

# session-settings.projection.codec.quality.constantBitrate
source: 고정 비트레이트
en: Constant Bitrate (CBR)
ja: 固定ビットレート
zh_hans: 固定码率

# session-settings.projection.codec.quality.default_desc
source: 품질 정책을 설정합니다.
en: Sets the quality policy.
ja: 品質ポリシーを設定します。
zh_hans: 设置质量策略。

# session-settings.projection.codec.quality.lossless
source: 무손실 (권장하지 않음)
en: Lossless (Not Recommended)
ja: ロスレス (推奨しません)
zh_hans: 无损 (不推荐)

# session-settings.projection.codec.quality.manual_warning
source: 참고: 이 정책을 사용하면 네트워크 상태에 따른 퀄리티 디그레이드가 동작하지 않게 됩니다.
en: Note: Using this policy disables quality degradation based on network conditions.
ja: 参考: このポリシーを使用すると、ネットワークの状態による画質の低下が機能しなくなります。
zh_hans: 注意：使用此策略时，不会根据网络状态降低画质。

# session-settings.projection.codec.quality.title
source: 품질 정책
en: Quality Policy
ja: 品質ポリシー
zh_hans: 质量策略

# session-settings.projection.codec.quality.variableBitrate
source: 가변 비트레이트
en: Variable Bitrate (VBR)
ja: 可変ビットレート
zh_hans: 可变码率

# session-settings.projection.codec.tab.advanced
source: 고급 설정
en: Advanced
ja: 詳細設定
zh_hans: 高级设置

# session-settings.projection.codec.tab.basic
source: 기본 설정
en: Basic
ja: 基本設定
zh_hans: 基本设置

# session-settings.projection.codec.title_format
source: %@ 코덱 설정
en: %@ Codec Settings
ja: %@ コーデック設定
zh_hans: %@ 编解码器设置

# session-settings.projection.codec.variableBitrate.description
source: 가변 비트레이트를 사용하도록 서버에게 요구합니다.
en: Requests the server to use variable bitrate.
ja: 可変ビットレートを使用するようにサーバーに要求します。
zh_hans: 要求服务器使用可变码率。

# session-settings.projection.codec.variableBitrate.maxBitrateSlider.title
source: 최대 비트레이트
en: Maximum Bitrate
ja: 最大ビットレート
zh_hans: 最大码率

# session-settings.projection.codec.variableBitrate.targetBitrateSlider.title
source: 타겟 비트레이트
en: Target Bitrate
ja: ターゲットビットレート
zh_hans: 目标码率

# session-settings.projection.negotiation
source: 코덱 협상 정책
en: Codec Negotiation Policy
ja: コーデックネゴシエーションポリシー
zh_hans: 编解码器协商策略

# session-settings.projection.negotiation_desc
source: 서버와의 코덱 협상 정책을 설정합니다.
en: Set codec negotiation policy with server.
ja: サーバーとのコーデックネゴシエーションポリシーを設定します。
zh_hans: 设置与服务器的编解码器协商策略。

# session-settings.projection.negotiation.mandatory
source: 요구 사항 우선
en: Requirements First
ja: 要求事項優先
zh_hans: 要求优先

# session-settings.projection.negotiation.mandatory_desc
source: 사용자가 지정한 코덱 관련 요구 사항을 전부 필수적인 것으로 마킹합니다. 서버가 요구 사항을 충족하지 못할 경우 협상에 실패할 수 있습니다. 또한, 서버 측의 코덱 협상 정책에 따라 요구 사항이 무시될 수도 있습니다.
en: Mark all user-specified codec requirements as mandatory. Negotiation may fail if the server cannot meet the requirements. Also, requirements may be ignored depending on the server's codec negotiation policy.
ja: ユーザーが指定したコーデック関連の要求事項をすべて必須のものとしてマークします。 サーバーが要求事項を満たせない場合、ネゴシエーションに失敗する可能性があります。 また、サーバー側のコーデックネゴシエーションポリシーによって要求事項が無視される場合もあります。
zh_hans: 将用户指定的所有编解码器相关要求标记为必须。 如果服务器无法满足要求，协商可能会失败。 此外，根据服务器端的编解码器协商策略，要求可能会被忽略。

# session-settings.projection.negotiation.optional
source: 호환성 우선 **(권장)**
en: Compatibility First **(Recommended)**
ja: 互換性優先 **(推奨)**
zh_hans: 兼容性优先 **(推荐)**

# session-settings.projection.negotiation.optional_desc
source: 사용자가 지정한 코덱 관련 요구 사항을 전부 필수적이지 않은 것으로 마킹합니다. 유연하게 협상이 가능하지만 요구 사항이 전부 충족되지 않을 수도 있습니다.
en: Mark all user-specified codec requirements as optional. Allows flexible negotiation, but requirements may not be fully met.
ja: ユーザーが指定したコーデック関連の要求事項をすべて必須ではないものとしてマークします。 柔軟にネゴシエーションが可能ですが、要求事項がすべて満たされない場合もあります。
zh_hans: 将用户指定的所有编解码器相关要求标记为非必须。 虽然可以灵活协商，但要求可能不会全部得到满足。

# session-settings.save_and_connect
source: 연락처에 저장 후 연결하기
en: Save to Contacts and Connect
ja: 連絡先に保存して接続する
zh_hans: 保存到联系人并连接

# session-settings.save_and_connect.short
source: 저장 후 연결
en: Save & Connect
ja: 保存して接続
zh_hans: 保存并连接

# session-settings.security.credential_add.description
source: 추가할 자격 증명 유형을 선택하세요.
en: Select the type of credential to add.
ja: 追加する資格情報の種類を選択してください。
zh_hans: 请选择要添加的凭据类型。

# session-settings.security.credential_add.display_name_placeholder
source: 표시 이름 (선택 사항)
en: Display Name (Optional)
ja: 表示名 (オプション)
zh_hans: 显示名称 (可选)

# session-settings.security.credential_add.password.header
source: 사용자명-비밀번호
en: Username-Password
ja: ユーザー名-パスワード
zh_hans: 用户名-密码

# session-settings.security.credential_add.password.password
source: 비밀번호
en: Password
ja: パスワード
zh_hans: 密码

# session-settings.security.credential_add.password.username
source: 사용자명
en: Username
ja: ユーザー名
zh_hans: 用户名

# session-settings.security.credential_add.simple_password.header
source: 간단 비밀번호
en: Simple Password
ja: 簡易パスワード
zh_hans: 简单密码

# session-settings.security.credential_add.simple_password.password
source: 비밀번호
en: Password
ja: パスワード
zh_hans: 密码

# session-settings.security.credential_add.ssh_key.header
source: SSH 키
en: SSH Key
ja: SSHキー
zh_hans: SSH 密钥

# session-settings.security.credential_add.ssh_key.private_key_placeholder
source: 개인 키 (OpenSSH 형식 / PEM 형식을 지원합니다)
en: Private Key (Supports OpenSSH / PEM format)
ja: 秘密鍵 (OpenSSH形式 / PEM形式をサポートします)
zh_hans: 私钥 (支持 OpenSSH 格式 / PEM 格式)

# session-settings.security.credential_add.template.password.description
source: 사용자명과 비밀번호를 사용한 인증을 수행합니다.
en: Authenticate using username and password.
ja: ユーザー名とパスワードを使用した認証を行います。
zh_hans: 执行使用用户名和密码的认证。

# session-settings.security.credential_add.template.password.title
source: 사용자명-비밀번호 인증
en: Username-Password Auth
ja: ユーザー名-パスワード認証
zh_hans: 用户名-密码认证

# session-settings.security.credential_add.template.simple_password.description
source: 비밀번호만을 사용한 인증을 수행합니다.
en: Authenticate using only a password.
ja: パスワードのみを使用した認証を行います。
zh_hans: 执行仅使用密码的认证。

# session-settings.security.credential_add.template.simple_password.title
source: 간단 비밀번호 인증
en: Simple Password Auth
ja: 簡易パスワード認証
zh_hans: 简单密码认证

# session-settings.security.credential_add.template.ssh_key.description
source: SSH 공개 키/개인 키 기반 인증을 수행합니다.
en: Authenticate using SSH public/private keys.
ja: SSH公開鍵/秘密鍵ベースの認証を行います。
zh_hans: 执行基于 SSH 公钥/私钥的认证。

# session-settings.security.credential_add.template.ssh_key.title
source: SSH 키 인증
en: SSH Key Auth
ja: SSHキー認証
zh_hans: SSH 密钥认证

# session-settings.security.credential_add.title
source: 자격 증명 추가
en: Add Credential
ja: 資格情報追加
zh_hans: 添加凭据

# session-settings.security.credentials
source: 자격 증명
en: Credentials
ja: 資格情報
zh_hans: 凭据

# session-settings.security.credentials.description.global
source: 글로벌 자격 증명은 모든 호스트에 대해 자동으로 사용됩니다.
en: Global credentials are used automatically for all hosts.
ja: グローバル資格情報はすべてのホストに対して自動的に使用されます。
zh_hans: 全局凭据会自动用于所有主机。

# session-settings.security.credentials.description.session
source: 선택된 호스트에 대한 자격 증명을 구성합니다.
en: Configure credentials for the selected host.
ja: 選択されたホストに対する資格情報を構成します。
zh_hans: 配置选定主机的凭据。

# session-settings.security.credentials.empty
source: (구성된 자격 증명이 없습니다) 추가 버튼을 눌러 자격 증명을 등록하세요.
en: (No credentials configured) Click the Add button to register credentials.
ja: (構成された資格情報がありません) 追加ボタンを押して資格情報を登録してください。
zh_hans: (没有配置凭据) 请点击添加按钮注册凭据。

# session-settings.security.credentials.no_contact_selected
source: 연락처가 선택되지 않아 자격 증명을 관리할 수 없습니다.
en: Cannot manage credentials because no contact is selected.
ja: 連絡先が選択されていないため資格情報を管理できません。
zh_hans: 未选择联系人，无法管理凭据。

# session-settings.security.credentials.title
source: 자격 증명 목록
en: Credentials List
ja: 資格情報一覧
zh_hans: 凭据列表

# session-settings.security.protocol
source: 프로토콜
en: Protocol
ja: プロトコル
zh_hans: 协议

# session-settings.security.protocol_desc
source: Sirius 프로토콜의 동작 방식을 구성합니다.
en: Configure how the Sirius protocol behaves.
ja: Siriusプロトコルの動作方式を構成します。
zh_hans: 配置 Sirius 协议的行为方式。

# session-settings.security.protocol.disable_version
source: 클라이언트 버전을 알리지 않기
en: Do Not Announce Client Version
ja: クライアントバージョンを通知しない
zh_hans: 不通报客户端版本

# session-settings.security.protocol.disable_version_desc
source: 클라이언트 버전을 서버에게 알리지 않습니다. 일부 서버에서는 접속을 거절하거나 기능을 제한할 수도 있습니다.
en: Do not announce the client version to the server. Some servers may refuse connection or limit functionality.
ja: クライアントのバージョンをサーバーに通知しません。 一部のサーバーでは接続を拒否したり機能を制限したりする場合があります。
zh_hans: 不向服务器通报客户端版本。 部分服务器可能会拒绝连接或限制功能。

# session-settings.security.protocol.urara.desc
source: 君の 夢は うららかに
en: May your dreams be clear and bright

# session-settings.security.protocol.urara.h3
source: ALPN 어나운스 시 'h3'을 대신 사용하기
en: Use 'h3' for ALPN announcement
ja: ALPNアナウンス時に「h3」を代わりに使用する
zh_hans: 宣布 ALPN 时使用 'h3' 替代

# session-settings.security.protocol.urara.h3.desc
source: 일부 네트워크 환경에서의 호환성을 개선시킬 수 있을거라 믿고 싶습니다.
en: I want to believe this might improve compatibility in some network environments.
ja: 一部のネットワーク環境での互換性を改善できると信じたいです。
zh_hans: 希望能够改善在某些网络环境下的兼容性。

# session-settings.security.protocol.urara.title
source: 개발용 설정: 麗 (우라라) 모드
en: Developer Settings: Urara Mode
ja: 開発用設定: 麗 (うらら) モード
zh_hans: 开发用设置：丽 (Urara) 模式

# session-settings.security.tls.default
source: 기본
en: Default
ja: デフォルト
zh_hans: 默认

# session-settings.security.tls.default_desc
source: 모든 호스트가 신뢰받은 인증 기관으로부터 SSL/TLS 인증서를 발급받을 수 없다는 상황을 감안합니다. 자가 서명 인증서를 사용한 호스트의 경우 경고 팝업을 표시합니다.
en: Accommodates the situation where not all hosts can get SSL/TLS certificates from trusted CAs. Displays a warning popup for hosts using self-signed certificates.
ja: すべてのホストが信頼された認証局からSSL/TLS証明書を発行してもらえない状況を考慮します。 自己署名証明書を使用したホストの場合、警告ポップアップを表示します。
zh_hans: 考虑到并非所有主机都能从受信任的证书颁发机构获取 SSL/TLS 证书的情况。 如果是使用自签名证书的主机，则会显示警告弹窗。

# session-settings.security.tls.policy
source: 유효성 검사 정책
en: Validation Policy
ja: 検証ポリシー
zh_hans: 验证策略

# session-settings.security.tls.policy_desc
source: 서버의 SSL/TLS 인증서의 유효성 검사 수준을 설정합니다.
en: Set validation level for server SSL/TLS certificate.
ja: サーバーのSSL/TLS証明書の検証レベルを設定します。
zh_hans: 设置服务器 SSL/TLS 证书的验证级别。

# session-settings.security.tls.strict
source: 엄격히
en: Strict
ja: 厳格に
zh_hans: 严格

# session-settings.security.tls.strict_desc
source: 시스템의 트러스트 스토어를 기준으로 서버의 SSL/TLS 인증서를 엄격하게 검사합니다. 자가 서명 인증서를 사용 중인 호스트의 경우 연결에 실패할 수 있습니다.
en: Strictly validate server SSL/TLS certificates against the system trust store. Connections to hosts using self-signed certificates may fail.
ja: システムのトラストストアを基準にサーバーのSSL/TLS証明書を厳格に検証します。 自己署名証明書を使用中のホストの場合、接続に失敗する可能性があります。
zh_hans: 根据系统信任存储库严格检查服务器的 SSL/TLS 证书。 如果是使用自签名证书的主机，连接可能会失败。

# session-settings.security.tls.unsafe
source: 수행하지 않기 **(위험!)**
en: Do Not Perform **(Dangerous!)**
ja: 検証しない **(危険!)**
zh_hans: 不执行验证 **(危险!)**

# session-settings.security.tls.unsafe_desc
source: 서버의 SSL/TLS 인증서의 유효성 검사를 수행하지 않습니다. 제 3자가 통신 내용을 훔쳐보거나 변조하는 중간자 공격 (MITM)에 취약하므로 권장하지 않습니다.
en: Do not validate the server's SSL/TLS certificate. Not recommended as it is vulnerable to Man-in-the-Middle (MITM) attacks where a third party could eavesdrop on or tamper with communication.
ja: サーバーのSSL/TLS証明書の検証を行いません。 第三者が通信内容を盗聴したり改ざんする中間者攻撃 (MITM) に脆弱なため推奨しません。
zh_hans: 不验证服务器的 SSL/TLS 证书有效性。 这容易受到第三方窃听或篡改通信内容的中间人攻击 (MITM) 威胁，因此不建议使用。

# session-settings.security.transport
source: 트랜스포트 레이어
en: Transport Layer
ja: トランスポート層
zh_hans: 传输层

# session-settings.security.transport_desc
source: Noctiluca에서는 QUIC 프로토콜을 사용하여 통신합니다.
en: Noctiluca communicates using the QUIC protocol.
ja: NoctilucaではQUICプロトコルを使用して通信します。
zh_hans: Noctiluca 使用 QUIC 协议进行通信。

# session-settings.tabs.general
source: 일반
en: General
ja: 一般
zh_hans: 通用

# session-settings.tabs.input
source: 입력
en: Input
ja: 入力
zh_hans: 输入

# session-settings.tabs.projection
source: 프로젝션
en: Projection
ja: プロジェクション
zh_hans: 投影

# session-settings.tabs.security
source: 보안
en: Security
ja: セキュリティ
zh_hans: 安全

# session-settings.tabs.transfer
source: 전송
en: Transfer
ja: 転送
zh_hans: 传输

# session-settings.title
source: 세션 설정
en: Session Settings
ja: セッション設定
zh_hans: 会话设置

# session-settings.transfer.channel.compression.description
source: Zstd 압축을 사용할지 여부를 설정합니다. 데이터 전송량이 줄어들 수 있지만, 컴퓨팅 자원 사용량이 늘어날 수 있습니다.
en: Configure whether to use Zstd compression. This may reduce data transfer volume, but may increase computing resource usage.
ja: Zstd圧縮を使用するかどうかを設定します。 データ転送量が減少する可能性がありますが、コンピューティングリソースの使用量が増加する可能性があります。
zh_hans: 设置是否使用Zstd压缩。 可能减少数据传输量，但可能增加计算资源使用量。

# session-settings.transfer.channel.compression.title
source: 가능한 경우 압축 사용하기
en: Use Compression When Possible
ja: 可能な場合は圧縮を使用する
zh_hans: 尽可能使用压缩

# session-settings.transfer.channel.section_description
source: 데이터 전송을 위한 Transfer 채널 관련 정책을 설정합니다.
en: Configure policies for the Transfer channel used for data transmission.
ja: データ転送のためのTransferチャンネルに関するポリシーを設定します。
zh_hans: 设置用于数据传输的Transfer通道相关策略。

# session-settings.transfer.channel.section_title
source: Transfer 채널
en: Transfer Channel
ja: Transferチャンネル
zh_hans: Transfer通道

# session-settings.transfer.clipboard.allow_file.description
source: ⌘C / ⌘V와 같은 클립보드 복사/붙여넣기 동작을 통해 파일을 복사하는 것을 허용할지 여부를 설정합니다.
en: Configure whether to allow copying files through clipboard copy/paste operations such as ⌘C / ⌘V.
ja: ⌘C / ⌘Vなどのクリップボードのコピー/ペースト操作を通じてファイルをコピーすることを許可するかどうかを設定します。
zh_hans: 设置是否允许通过 ⌘C / ⌘V 等剪贴板复制/粘贴操作来复制文件。

# session-settings.transfer.clipboard.allow_file.title
source: 파일 복사 허용하기 (실험적)
en: Allow File Copying (Experimental)
ja: ファイルのコピーを許可する（実験的）
zh_hans: 允许复制文件（实验性）

# session-settings.transfer.clipboard.bidirectional_sync.description
source: 로컬→원격 호스트로의 클립보드 동기화도 허용합니다.
en: Also allows clipboard synchronization from local to the remote host.
ja: ローカル→リモートホストへのクリップボード同期も許可します。
zh_hans: 也允许从本地到远程主机的剪贴板同步。

# session-settings.transfer.clipboard.enabled.description
source: 클립보드 공유 기능을 사용할지 여부를 설정합니다. 이 기능이 활성화된 경우, 클라이언트와 서버 간에 클립보드 데이터를 주고받을 수 있습니다.
en: Configure whether to use the clipboard sharing feature. When enabled, clipboard data can be exchanged between the client and server.
ja: クリップボード共有機能を使用するかどうかを設定します。この機能が有効な場合、クライアントとサーバー間でクリップボードデータをやり取りできます。
zh_hans: 设置是否使用剪贴板共享功能。启用后，客户端与服务器之间可以交换剪贴板数据。

# session-settings.transfer.clipboard.enabled.title
source: 클립보드 공유 사용하기
en: Enable Clipboard Sharing
ja: クリップボード共有を使用する
zh_hans: 启用剪贴板共享
